The  DocumentSavingAsEventArgs  type exposes the following members.
 Methods
Name  |   Description
Cancel
 When the event is cancellable, may call the Cancel() method to cancel it.
 (Inherited from  RevitAPIPreEventArgs  .)
Dispose   |   (Inherited from  RevitAPIEventArgs  .)
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from  RevitAPIEventArgs  .)
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 Properties
Name  |   Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from  RevitAPIEventArgs  .)
Document
 The document associated with the event.
 (Inherited from  RevitAPIPreDocEventArgs  .)
IsSavingAsMasterFile
 Indicates whether the document is to be saved as master file.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  RevitAPIEventArgs  .)
PathName
 Target path to which the document is to be saved.
 See Also
  DocumentSavingAsEventArgs Class
  Autodesk.Revit.DB.Events Namespace